from openpyxl import Workbook

# 创建一个新的工作簿
wb = Workbook()
# 获取默认的工作表
ws = wb.active
# 设置表头
ws['A1'] = '序号'
ws['B1'] = '地点'

locations = [
    "成都",
    "汶川",
    "茂县",
    "松潘",
    "川主寺",
    "九寨沟",
    "黄龙",
    "达古冰川",
    "牟尼沟",
    "红原",
    "若尔盖",
    "花湖",
    "九曲黄河第一湾",
    "阿坝",
    "年宝叶则",
    "壤塘",
    "色达",
    "色达佛学院",
    "翁达",
    "马尔康",
    "鹧鸪山",
    "毕棚沟",
    "理县",
    "小金",
    "四姑娘山",
    "丹巴",
    "甲居藏寨",
    "道孚",
    "八美",
    "墨石公园",
    "八郎生都",
    "塔公草原",
    "雅拉雪山",
    "新都桥",
    "康定",
    "木格措",
    "达瓦根扎",
    "宝兴",
    "泸定",
    "雅安",
    "芦山",
    "牛背山",
    "石棉",
    "冕宁",
    "西昌",
    "泸沽湖",
    "九龙",
    "伍须海",
    "泉华滩",
    "冷噶措",
    "贡嘎雪山",
    "子梅垭口",
    "雅哈垭口",
    "甲根坝",
    "折多山",
    "红石滩",
    "海螺沟",
    "新龙",
    "理塘",
    "毛垭大草原",
    "卡子拉山",
    "雅江",
    "莲花湖",
    "黑石山",
    "稻城",
    "稻城亚丁",
    "乡城",
    "格聂雪山",
    "冷古寺",
    "喇嘛亚乡",
    "巴塘",
    "措普沟",
    "姊妹湖",
    "白玉",
    "巴巴海",
    "德格",
    "马尼干戈",
    "错通翠湖",
    "甘孜县",
    "卡萨湖",
    "炉霍",
    "石渠"
]

# 逐行写入数据
for index, location in enumerate(locations, start=1):
    ws.cell(row=index + 1, column=1, value=index)
    ws.cell(row=index + 1, column=2, value=location)

# 保存工作簿为xlsx文件
wb.save('nodes.xlsx')